package com.aarsenij.rucountablenouns

import com.aarsenij.rucountablenouns.forms.Род
import com.aarsenij.rucountablenouns.types.Прилагательное
import com.aarsenij.rucountablenouns.types.Существительное

val eventNoun = Существительное(
    "событие", "события", "событию", "событие", "событием", "событии",
    "события", "событий", "событиям", "события", "событиями", "событиях",
    Род.СРЕДНИЙ
)

val longAdj = Прилагательное(
    "долгий", "долгого", "долгому", "долгий", "долгим", "долгом",
    "долгая", "долгой", "долгой", "долгую", "долгой", "долгой",
    "долгое", "долгого", "долгому", "долгое", "долгим", "долгом",
    "долгие", "долгих", "долгим", "долгие", "долгими", "долгих"
)

val roubleNoun = Существительное(
    "рубль", "рубля", "рублю", "рубль", "рублём", "рубле",
    "рубли", "рублей", "рублям", "рубли", "рублями", "рублях",
    Род.МУЖСКОЙ
)

val copeykaNoun = Существительное(
    "копейка", "копейки", "копейке", "копейку", "копейкой", "копейке",
    "копейки", "копеек", "копейкам", "копейки", "копейками", "копейках",
    Род.ЖЕНСКИЙ
)
val minuteNoun = Существительное(
    "минута", "минуты", "минуте", "минуту", "минутой", "минуте",
    "минуты", "минут", "минутам", "минуты", "минутами", "минутах",
    Род.ЖЕНСКИЙ
)

val hourNoun = Существительное(
    "час", "часа", "часу", "час", "часом", "часе",
    "часы", "часов", "часам", "часы", "часами", "часах",
    Род.МУЖСКОЙ
)

val dayNoun = Существительное(
    "день", "дня", "дню", "день", "днём", "дне",
    "дни", "дней", "дням", "дни", "днями", "днях",
    Род.МУЖСКОЙ
)

val weekNoun = Существительное(
    "неделя", "недели", "неделе", "неделю", "неделей", "неделе",
    "недели", "недель", "неделям", "недели", "неделями", "неделях",
    Род.ЖЕНСКИЙ
)

val monthNoun = Существительное(
    "месяц", "месяца", "месяцу", "месяц", "месяцем", "месяце",
    "месяцы", "месяцев", "месяцам", "месяцы", "месяцами", "месяцах",
    Род.МУЖСКОЙ
)

val yearNoun = Существительное(
    "год", "года", "году", "год", "годом", "годе",
    "годы", "лет", "годам", "годы", "годами", "годах",
    Род.МУЖСКОЙ
)